papers/gosaste.org
#+TITLE: ریاضیات گسسته
# #+LATEX_CLASS_OPTIONS: [a5paper]
#+LATEX_HEADER: \usepackage{xepersian}\settextfont{XB Roya}\setlatintextfont{XB Roya}\setmonofont{Iosevka}\setmathdigitfont{XB Roya}
#+LATEX_HEADER: \usepackage[bottom]{footmisc} \makeatletter\def\blfootnote{\xdef\@thefnmark{}\@footnotetext}\makeatother \newcommand{\reminder}[1]{{\let\thefootnote\relax\footnotetext{* #1}}}
#+LATEX_HEADER: \captionsetup[table]{name=جدول}
#+MACRO: c @@comment:$1@@
#+MACRO: m @@latex:\$1{@@$2@@latex:}@@
#+MACRO: l @@latex:\$1@@
#+MACRO: lb @@latex:\begin{$1}@@
#+MACRO: le @@latex:\end{$1}@@


* فهرست :TOC_3:noexport:
- [[#منطق-و-گزاره][منطق و گزاره]]
  - [[#رابطهای-اولیه-و-جدول-درستی][رابط‌های اولیه و جدول درستی]]
    - [[#نقیض-not][نقیض (Not)]]
    - [[#ترکیب-عطفی-and][ترکیب عطفی (And)]]
    - [[#ترکیب-فصلی-or][ترکیب فصلی (Or)]]
    - [[#یای-مانع-جمع-انحصاری-mlrexclusive-or--aut][یای مانع جمع (انحصاری) ({{{m(lr,Exclusive or / Aut)}}})]]
    - [[#ترکیب-شرطی][ترکیب شرطی]]
    - [[#ترکیب-دوشرطی][ترکیب دوشرطی]]
    - [[#خواص-گزارهها][خواص گزاره‌ها]]

* منطق و گزاره
گزاره یا Statement یک جمله خبری است که یا درست است و یا نادرست. امکان  درستی و نادرستی همزمان یک گزاره وجود ندارد.

** رابط‌های اولیه و جدول درستی
تعداد ترکیب‌های جدول درستی برای $n$ گزارهٔ مبنا معادل $2^{n}$ است.

رابط‌های گزاره‌ای ([[tb:tools]]) ابزارهایی برای ایجاد گزاره‌های ترکیبی بکار می‌روند.
#+CAPTION: جدول رابط‌های اصلی گزاره‌ای و نمادهای آن‌ها
#+NAME: tb:tools
|                      نام                      |                         نماد                         |         مفهوم         |
|-----------------------------------------------+------------------------------------------------------+-----------------------|
|                      <c>                      |                         <c>                          |          <c>          |
|                  نقیض (Not)                   | $\lnot$, \sim, بار بالای متغیر، $'$ بعد از متغیر یا $!$ |       چنین نیست       |
|               ترکیب عطفی (And)                |                    $\land$ یا $\cdot$                    |       $p$ و $q$       |
|                ترکیب فصلی (Or)                |                    $\lor$ یا $+$                     |      $p$ یا $q$       |
| یای مانع جمع ({{{m(lr,Exclusive or / Aut)}}}) |                      $\veebar$ یا $\oplus$                      |  فقط $p$ یا فقط $q$   |
|              ترکیب شرطی (الزام)               |                         $\Rightarrow$                          |   اگر $p$ آنگاه $q$   |
|                 ترکیب دوشرطی                  |                         $\Leftrightarrow$                          | $p$ اگر و فقط اگر $q$ |
#+TBLFM: @2='(eval "<c>");

*** نقیض (Not)

اگر $p$ یک گزاره باشد، نقیض آن را به صورت $\lnot p$ نشان می‌دهیم.
این گزاره زمانی درست است که $p$ نادرست باشد.

#+CAPTION: جدول رابط‌های اصلی گزاره‌ای و نمادهای آن‌ها
#+NAME: tb:not
| $p$ | $\lnot p$ |
|-----+-----------|
| <c> |    <c>    |
|  /  |     <     |
|  0  |     1     |
|  1  |     0     |
#+TBLFM: @2='(eval "<c>"); :: $2=!$1;

با توجه به جدول [[tb:not]] می‌توان نتیجه گرفت هردو هم‌ارز[fn:1] هستند:

\begin{equation}
\lnot(\lnot p) \quad \overbrace{\equiv}^{\text{هم ارزی*}} \quad p
\end{equation}

[fn:1] هرگاه دو گزاره مرکب --- صرف نظر از ارزش مؤلفه‌های آن‌ها --- ارزش‌های یکسان داشته باشند از لحاظ منطقی هم‌ارز هستند که آنرا با نماد $\equiv$ نشان می‌دهیم.

*** ترکیب عطفی (And)
اگر $p$ و $q$ دو گزاره باشند و بخواهیم از صحت هر دو اطمینان حاصل کنیم از ترکیب عطفی ($p \land q$) استفاده می‌کنیم (جدول [[tb:and]]).

#+CAPTION: جدول مقادیر ترکیب عطفی
#+NAME: tb:and
| $p$ | $q$ | $p \land q$ |
|-----+-----+-------------|
| <c> | <c> |     <c>     |
|  /  |     |      <      |
|  1  |  1  |      1      |
|  1  |  0  |      0      |
|  0  |  1  |      0      |
|  0  |  0  |      0      |
#+TBLFM: @2='(eval "<c>"); ::$3=$1&&$2;

*** ترکیب فصلی (Or)
اگر $p$ و $q$ دو گزاره باشند و بخواهیم از صحت یکی از آنها اطمینان حاصل کنیم از ترکیب فصلی ($p \lor q$) استفاده می‌کنیم (جدول [[tb:or]]).

#+CAPTION: جدول مقادیر ترکیب فصلی
#+NAME: tb:or
| $p$ | $q$ | $p \lor q$ |
|-----+-----+------------|
| <c> | <c> |    <c>     |
|  /  |     |     <      |
|  1  |  1  |     1      |
|  1  |  0  |     1      |
|  0  |  1  |     1      |
|  0  |  0  |     0      |
#+TBLFM: @2='(eval "<c>"); ::$3=$1||$2;

*** یای مانع جمع (انحصاری) ({{{m(lr,Exclusive or / Aut)}}})
اگر $p$ و $q$ دو گزاره باشند و بخواهیم از صحت *فقط یکی* از آنها اطمینان حاصل کنیم از یای انحصاری ($p \oplus q$) استفاده می‌کنیم (جدول [[tb:xor]])

#+CAPTION: جدول مقادیر یای انحصاری
#+NAME: tb:xor
| $p$ | $q$ | $p \oplus q$ |
|-----+-----+---------|
| <c> | <c> |   <c>   |
|  /  |     |    <    |
|  1  |  1  |    0    |
|  1  |  0  |    1    |
|  0  |  1  |    1    |
|  0  |  0  |    0    |
#+TBLFM: @2='(eval "<c>"); ::$3=xor($1,$2);

*** ترکیب شرطی
هرگاه بخواهیم از گزاره $p$ گزاره $q$ را نتیجه بگیریم، از ترکیب شرطی استفاده می‌کنیم (جدول [[tb:imp]]). برای بیان آن می‌نویسیم $p \Rightarrow q$ که به شکل‌های زیر می‌تواند خوانده شود:
- اگر $p$ آنگاه $q$.
- $p$, $q$ را نتیجه می‌دهد.
- $q$ از $p$ نتیجه می‌دهد.
در عبارت $p \Rightarrow q$، $p$ مقدم و $q$ تالی است.

#+CAPTION: جدول مقادیر ترکیب شرطی
#+NAME: tb:imp
| $p$ | $q$ | $p \Rightarrow q$ |
|-----+-----+---------|
| <c> | <c> |   <c>   |
|  /  |     |    <    |
|  1  |  1  |    1    |
|  1  |  0  |    0    |
|  0  |  1  |    1    |
|  0  |  0  |    1    |
#+TBLFM: @2='(eval "<c>"); ::$3=!$1||$2;

با توجه به جدول مقادیر (جدول [[tb:imp]]) می‌توان نتیجه گرفت:

\begin{equation}
\lnot p \lor q \quad \equiv \quad p \Rightarrow q
\end{equation}

*** ترکیب دوشرطی
اگر بخواهیم از گزاره $p$ گزاره $q$ را نتیجه بگیریم و از گزاره $q$ گزاره $p$ را، می‌نویسیم $p \Leftrightarrow q$ (جدول [[tb:imi]]).

#+CAPTION: جدول مقادیر ترکیب دوشرطی
#+NAME: tb:imi
| $p$ | $q$ | $p \Rightarrow q$ | $q \Rightarrow p$ | $p \Leftrightarrow q$ |
|-----+-----+---------+---------+---------|
| <c> | <c> |   <c>   |   <c>   |   <c>   |
|  /  |  >  |    <    |    >    |    <    |
|  1  |  1  |    1    |    1    |    1    |
|  1  |  0  |    0    |    1    |    0    |
|  0  |  1  |    1    |    0    |    0    |
|  0  |  0  |    1    |    1    |    1    |
#+TBLFM: @2='(eval "<c>"); ::$3=!$1||$2; ::$4=!$2||$1; ::$5=$3&&$4;

با توجه به جدول مقادیر ([[tb:imi]]) می‌توان نتیجه گرفت:

\begin{equation}
p \Leftrightarrow q \quad \equiv \quad (p \Rightarrow q) \land (q \Rightarrow p) \quad \equiv \quad (\lnot p \lor q) \land (\lnot q \lor p)
\end{equation}

گزاره راستگو گزاره‌ای است که همواره برابر با $1$ باشد.
گزاره‌ای که همواره $0$ است را گزاره متناقض گویند.

*** خواص گزاره‌ها
گزاره‌ها خواصی دارند که به شرح زیر است:

\begin{equation}
  \text{خودتوانی}\begin{cases}
    p \lor p \quad \equiv \quad p \\
    p \land p \quad \equiv \quad p
  \end{cases}
\end{equation}
\begin{equation}
  \text{جذبی}\begin{cases}
    p \lor (p \land q) \quad \equiv \quad p \\
    p \land (p \lor q) \quad \equiv \quad p
  \end{cases}
\end{equation}
\begin{equation}
  \text{جابه‌جایی}\begin{cases}
    p \lor q \quad \equiv \quad q \lor p \\
    p \land q \quad \equiv \quad q \land p
  \end{cases}
\end{equation}
\begin{equation}
  \text{شرکت‌پذیری}\begin{cases}
    p \lor (q \lor r) \quad \equiv \quad (p \lor q) \lor r \\
    p \land (q \land r) \quad \equiv \quad (p \land q) \land r
  \end{cases}
\end{equation}
\begin{equation}
  \text{توزیع‌پذیری}\begin{cases}
    p \lor (q \land r) \quad \equiv \quad (p \land q) \lor (p \land r) \\
    p \land (q \lor r) \quad \equiv \quad (q \lor q) \land p (p \lor r)
  \end{cases}
\end{equation}
\begin{equation}
  \text{متمم}\begin{cases}
    p \lor \lnot p \quad \equiv \quad 1 \\
    p \land \lnot p \quad \equiv \quad 0
  \end{cases}
\end{equation}
\begin{equation}
  \text{قانون دمورگان (\lr{De Morgan})}\begin{cases}
    \lnot(p \lor q) \quad \equiv \quad \lnot p \land \lnot q \\
    \lnot(p \land q) \quad \equiv \quad \lnot p \lor \lnot q
  \end{cases}
\end{equation}
\begin{equation}
  \text{قانون همانی}\begin{cases}
    (p \land 1) \equiv p \\
    (p \land 0) \equiv 0 \\
    (p \lor 1) \equiv 1 \\
    (p \lor 0) \equiv p
  \end{cases}
\end{equation}
